shared-functions.org

(define-minor-mode org-config-files-local-mode
    "Minor mode for editing configuration files in org-mode." 
    :init-value nil)
(define-key org-config-files-local-mode-map (kbd "<SPC>") 'insert-space) 
(setq abbrev-mode nil) )

You can toggle it in necessary files by setting the local variables section at the end of the file as follows. You can also change or add the keybinding here. You will still need to define different minor modes for each buffer that maps the same key-sequence to different commands.

 # Local Variables:
 # org-config-files-local-mode: t
 # eval: (define-key org-config-files-local-mode-map (kbd "<SPC>") 'insert-space) 
 # End: 
;;;   Current time:      (current-time-string)
;;;   Last command:      last-command
;;; (abbrev-mode)
(user-full-name)

* file settings                                                     :ARCHIVE:
#+OPTIONS: f:t
#+TODO: TODO PLEASE-TEST TESTING PLEASE-DEBUG | DONE
#+TODO: | NOTE-TO-JAY NOTE-TO-RÚDI NOTE-TO-RÚDI
#+TODO: PLEASE-CHECK-MY-INEPT-CODE PLEASE-HELP-ME-DEBUG-MY-INEPT-CODE TRY-THIS | DONE

# Local Variables:
# enable-local-eval: t 
# eval: (make-local-variable abbrev-mode) 
# eval: (define-key org-mode-map (kbd "<SPC>") 'insert-space) 
# eval: (setq abbrev-mode nil) 
# end: 

#+TITLE:Jay Dixit's Emacs setup - May 22, 2015.

* About
  - System: Mac OSX Yosemite
  - Emacs version: 24.5.1
  - Use case: I use this file with both GNU Emacs for OSX and for Aquamacs.

* Set up packages
** Load the proper repositories

#+BEGIN_SRC emacs-lisp
(require 'package)

(add-to-list 'package-archives
             '("marmalade" .
               "http://marmalade-repo.org/packages/" ))
(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)

(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/") t)

(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

(package-initialize)
#+END_SRC

*** Load some of my packages:
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/Dropbox/emacs/prelude/personal/")
#+END_SRC

** Require some packages
#+BEGIN_SRC emacs-lisp
(require 'org)
#+END_SRC
   
* Require some org packages
#+BEGIN_SRC emacs-lisp
;; (require 'org-bullets)
(require 'ox-latex)
(require 'ox-org)
  (require 'ox-html)

; (require 'org-fstree)
#+END_SRC

* Set up spellcheck 
** Spellcheck add word
#+BEGIN_SRC emacs-lisp
(defun add-word-to-personal-dictionary ()
  (interactive)
  (let ((current-location (point))
        (word (flyspell-get-word)))
    (when (consp word)
      (flyspell-do-correct 'save nil (car word) current-location (cadr word) (caddr word) current-location))))
#+END_SRC

** Turn on on-the-fly spellcheck for org-mode

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'turn-on-flyspell)
#+END_SRC

* UI / customization of appearance and editing environment
** Stop accidentally highlighting org-mode links all the time:

#+BEGIN_SRC emacs-lisp
(setq mouse-highlight nil)
(setq-local cursor-in-non-selected-windows nil) 

#+END_SRC

** Ask before exiting Emacs

#+BEGIN_SRC emacs-lisp
(setq confirm-kill-emacs 'yes-or-no-p)
#+END_SRC

** System alarms

In some cases, you'd like to reduce the number of warnings or eliminate warnings in certain conditions. The following turns off the alarm bell when you hit C-g in the minibuffer or during an isearch:
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function
      (lambda ()
	(unless (memq this-command
		      '(isearch-abort abort-recursive-edit exit-minibuffer keyboard-quit))
	  (ding))))
#+END_SRC

Also, change the alert sound. Instead of beeping or flashing, Emacs could play a cool sound file, whenever an error occurs:
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function (lambda () (play-sound-file "~/sounds/InkSoundStroke3.mp3")))
#+END_SRC


** Red cursor mode

This customization with the big blocky boxy red cursor makes me so happy.
# #+BEGIN_SRC emacs-lisp
(setq-default cursor-type 'box) 
(set-cursor-color "red")
(setq default-frame-alist
      '((cursor-color . "red")))
(add-to-list 'default-frame-alist '(cursor-color . "red"))
# #+END_SRC

And create a function to restore the red cursor in case a color-theme overwrites it:
#+BEGIN_SRC emacs-lisp
(defun  incarnadine-cursor ()
  (interactive)
  (set-cursor-color "red")
  (setq default-frame-alist
	'((cursor-color . "red")))
  (add-to-list 'default-frame-alist '(cursor-color . "red")))
#+END_SRC

** Split windows correctly

#+BEGIN_SRC emacs-lisp
(setq org-indirect-buffer-display 'current-window)
(setq undo-limit 100000)
(setq split-width-threshold 75)
#+END_SRC

** Use visual line mode whenever possible

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'turn-on-visual-line-mode)
(add-hook 'mail-mode-hook 'turn-on-visual-line-mode)
(add-hook 'message-mode-hook 'turn-on-visual-line-mode)
(visual-line-mode t)
(global-visual-line-mode t)
#+END_SRC

** Highlight current line

#+BEGIN_SRC emacs-lisp
;; (global-hl-line-mode t) ; turn it on for all modes by default
;; (global-hl-line-mode)
(make-variable-buffer-local 'global-hl-line-mode)
(add-hook 'message-mode-hook (lambda () (setq global-hl-line-mode nil)))
#+END_SRC

** Autofill mode

Turn off fill mode, which adds random line breaks in my text files:
#+BEGIN_SRC emacs-lisp
(auto-fill-mode -1)
(add-hook 'text-mode-hook  '(lambda () (auto-fill-mode -1)))
(add-hook 'org-mode-hook  '(lambda () (auto-fill-mode -1)))
;; (add-hook 'org-mode-hook  '(lambda () (writegood-mode 1)))
(add-hook 'markdown-mode-hook  '(lambda () (auto-fill-mode -1)))
(add-hook 'message-mode-hook  '(lambda () (auto-fill-mode -1)))
#+END_SRC

** Sounds

#+BEGIN_SRC emacs-lisp
(unless (and (fboundp 'play-sound-internal)
	     (subrp (symbol-function 'play-sound-internal)))
  (require 'play-sound))


(add-hook 'org-after-todo-state-change-hook 'my-org-after-todo)
(defun my-org-after-todo ()
  (play-sound-file "~/sounds/InkSoundStroke3.mp3"))
#+END_SRC

* Editing / environment settings
** Disable double spacing between sentences

#+BEGIN_SRC emacs-lisp
(setq sentence-end-double-space nil)
#+END_SRC

** Enable auto-revert

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
#+END_SRC

** Make typing override text selection

#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC

** Automatically pair parentheses
#+BEGIN_SRC emacs-lisp
(autopair-mode 1)
(setq buffer-save-without-query nil)
#+END_SRC

** Search in Spotlight
#+BEGIN_SRC emacs-lisp
(setq locate-command "mdfind")
#+END_SRC

** Automatically open files in their correct modes

#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist (cons '("\\.txt" . org-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.msg" . message-mode) auto-mode-alist))
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
(add-to-list 'auto-mode-alist '("\\.abbrev_defs\\'" . org-mode))
(add-to-list 'auto-mode-alist '("README$" . org-mode))
(add-to-list 'auto-mode-alist '("shared-functions$" . emacs-lisp-mode))
(add-to-list 'auto-mode-alist '("gnu-emacs-startup$" . emacs-lisp-mode))
(add-hook 'emacs-lisp-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'css-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'html-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'html-helper-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'eshell-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'shell-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'shell-script-mode-hook (lambda () (abbrev-mode -1)))
(add-hook 'term-mode-hook (lambda () (abbrev-mode -1)))
(add-to-list 'auto-mode-alist '("COMMIT_EDITMSG$" . diff-mode))
(add-to-list 'auto-mode-alist '("\\.css$" . css-mode))
(add-to-list 'auto-mode-alist '("\\.rb$" . ruby-mode))
(add-to-list 'auto-mode-alist '("Rakefile$" . ruby-mode))
(add-to-list 'auto-mode-alist '("\\.js\\(on\\)?$" . js2-mode))
(add-to-list 'auto-mode-alist '("\\.xml$" . nxml-mode))
(add-to-list 'auto-mode-alist '("\\.fountain$" . fountain-mode)) 
#+END_SRC

* Org-mode
** Org setup
*** Some favorite ~org~ settings:
#+BEGIN_SRC emacs-lisp
(setq org-use-property-inheritance t)
(setq org-ctrl-k-protect-subtree t)
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
(setq org-clock-persist t)
(setq org-export-with-smart-quotes t)
(setq org-fontify-quote-and-verse-blocks t)
;; blank lines before new headings
(setq org-blank-before-new-entry
      '((heading . always)
       (plain-list-item . nil)))
(setq org-return-follows-link t)
(setq org-export-with-planning t)

;; leave an empty line between folded subtrees
(setq org-cycle-separator-lines 1)

#+END_SRC

*** Load my org modules
#+BEGIN_SRC emacs-lisp
'(org-modules (quote (org-info org-jsinfo org-pomodoro org-mac-link org-mime )))
#+END_SRC
** Org custom functions
*** Archiving
(defadvice org-archive-subtree (around my-org-archive-subtree activate)
  (let ((org-archive-location
	 (if (save-excursion (org-back-to-heading)
			     (> (org-outline-level) 1))
	     (concat (car (split-string org-archive-location "::"))
		     "::* "
		     (car (org-get-outline-path)))
	   org-archive-location)))
    ad-do-it))
#+END_SRC
*** org-mode speed commands
#+BEGIN_SRC emacs-lisp
(setq org-use-speed-commands t)
(setq org-speed-commands-user (quote (
                                      ("k" . org-kill-note-or-show-branches)
                                      ("q" . bh/show-org-agenda)
                                      ("h" . org-agenda-schedule)
                                      ("d" . org-deadline)
                                      ("w" . org-refile)
                                      ("z" . org-add-note)
                                      ("A" . org-archive-subtree-default-with-confirmation)
                                      ("J" . org-clock-goto)
                                      ("Z" . ignore))))
#+END_SRC

