shared-functions.org
** Replace smart quotes with straight quotes
Replace smart quotes with straight quotes so that spell check can recognize words with contractions like "don't" and "can't." For when I paste text in that I've copied from the web.
#+BEGIN_SRC emacs-lisp
(defun replace-smart-quotes (beg end)
  "Replace 'smart quotes' in buffer or region with ascii quotes."
  (interactive "r")
  (format-replace-strings '(("\x201C" . "\"")
                            ("\x201D" . "\"")
                            ("\x2018" . "'")
                            ("\x2019" . "'"))
                          nil beg end))
#+END_SRC

** Paste and replace quotes
Haven't used this next one:
#+BEGIN_SRC emacs-lisp
(defun paste-and-replace-quotes ()
  "Yank (paste) and replace smart quotes from the source with ascii quotes."
  (interactive)
  (clipboard-yank)
  (replace-smart-quotes (mark) (point)))
#+END_SRC

* My custom functions/settings
** Buffers
*** Buffer-stack
I use buffer-stack to navigate between buffers using ⌘-left and ⌘-right:
#+BEGIN_SRC emacs-lisp
;; (require 'buffer-stack)
#+END_SRC

GNU Emacs:
#+BEGIN_SRC emacs-lisp
(global-set-key [(s-right)] 'buffer-stack-down)
(global-set-key [(s-left)] 'buffer-stack-up)
#+END_SRC

Aquamacs:
#+BEGIN_SRC emacs-lisp
(global-set-key [(A-right)] 'buffer-stack-down)
(global-set-key [(A-left)] 'buffer-stack-up)
#+END_SRC

*** Uniqify buffers
Open new buffers without prompting me for a filename global counter to ensure
every new buffer will be unique:
#+BEGIN_SRC emacs-lisp
(defvar new-buffer-count 0)

(defun new-buffer ()
  (interactive)
  (setq new-buffer-count (+ new-buffer-count 1))
  (switch-to-buffer (concat "buffer" (int-to-string new-buffer-count)))
  (org-mode))
(global-set-key (kbd "s-T") 'new-buffer)
;; (define-key key-minor-mode-map "\s-\S-T" 'new-buffer)

(defun new-lisp-buffer ()
  (interactive)
  (setq new-buffer-count (+ new-buffer-count 1))
  (switch-to-buffer (concat "buffer" (int-to-string new-buffer-count)))
  (emacs-lisp-mode))

#+END_SRC

*** Create new buffer as org-mode subtree in current file
#+BEGIN_SRC emacs-lisp
(defun org-new-scratch-buffer ()
  (interactive)
  (insert "* oh hi there! " (format-time-string "%F %l:%M%P\n\n"))
  (org-tree-to-indirect-buffer 'current-window)
  )
#+END_SRC

*** Don't autocorrect in minibuffer
#+BEGIN_SRC emacs-lisp
(add-hook 'minibuffer-setup-hook 'conditionally-disable-abbrev)
(add-hook 'minibuffer-exit-hook (lambda () (abbrev-mode 1)))
(add-hook 'minibuffer-setup-hook (lambda ()
                                   (abbrev-mode -1)))
#+END_SRC

*** Ignore case when reading buffer and file names
#+BEGIN_SRC emacs-lisp
(setq read-buffer-completion-ignore-case t)
(setq read-file-name-completion-ignore-case t)
#+END_SRC

* Browsing
** Make URLs in comments/strings clickable

#+BEGIN_SRC emacs-lisp
(add-hook 'find-file-hooks 'goto-address-prog-mode)
#+END_SRC

** Set the default browser
#+BEGIN_SRC emacs-lisp
(setq browse-url-browser-function 'browse-url-default-macosx-browser)
#+END_SRC

* Miscellaneous/unsorted settings

#+BEGIN_SRC emacs-lisp
'(cua-enable-cua-keys (quote shift))
'(cua-highlight-region-shift-only t)
'(cua-mode nil nil (cua-base))
'(cursor-type (quote box))
'(send-mail-function (quote sendmail-send-it))
'(shift-select-mode nil)
'(transient-mark-mode t)
'(user-mail-address "dixit@aya.yale.edu")
'(global-flyspell-mode t)
'(message-send-mail-function (quote message-send-mail-with-sendmail))
'(mail-send-mail-function (quote message-send-mail-with-sendmail))
'(setq mail-user-agent 'message-user-agent)
'(global-set-key [(A-W)]  'buffer-stack-bury-and-kill)
'(ns-right-command-modifier (quote meta))
'(ns-tool-bar-display-mode (quote both) t)
'(ns-tool-bar-size-mode nil t)
'(standard-indent 3)
'(ns-function-modifier (quote meta))
(transient-mark-mode t)
(tooltip-mode -1)
(setq ns-function-modifier 'hyper)
;; open files in an existing frame instead of a new frame
(setq ns-pop-up-frames nil)
#+END_SRC

** Open everything in its right mode; use ~org-mode~ whenever possible

#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist (cons '("\\.md" . org-mode) auto-mode-alist))
(setq auto-mode-alist (cons '("\\.abbrev_defs" . emacs-lisp-mode) auto-mode-alist))
;; is this the best mode for editing HTML?
(setq auto-mode-alist (cons '("\\.html" . web-mode) auto-mode-alist))
#+END_SRC

** Enable highlighting of text similar to standard word processors

#+BEGIN_SRC emacs-lisp
'(org-support-shift-select (quote always))
#+END_SRC

** Autocapitalization

#+BEGIN_SRC emacs-lisp
(require 'auto-capitalize)
(add-hook 'message-mode-hook 'turn-on-auto-capitalize-mode)
(add-hook 'org-mode-hook 'turn-on-auto-capitalize-mode)
;; (add-hook message-mode-hook turn-on-orgstruct)
#+END_SRC

** Define my default directory:

#+BEGIN_SRC emacs-lisp
(setq default-directory "~/Dropbox/writing/" )
#+END_SRC

* LaTeX
** Find LaTeX on my system

#+BEGIN_SRC emacs-lisp
(if (eq window-system 'mac)
    (add-to-list 'exec-path "/usr/local/texlive/2015/bin/universal-darwin")
  )
#+END_SRC

** XeLaTeX customisations

~org~ to LaTeX customisations, ~-shell-escape~ needed for ~minted~:
#+BEGIN_SRC emacs-lisp
(setq  ; org-export-dispatch-use-expert-ui t non-intrusive export dispatch
 org-latex-pdf-process               ; for regular export

 '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
   "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
   "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

;; don't add extra lines to numbered lists and bulleted lists (set to nil)
(setq org-export-preserve-breaks nil) 

;; add padding to numbered lists and bulleted lists (set to to)
;; (setq org-export-preserve-breaks t) 
#+END_SRC

** load my custom latex templates

   #+BEGIN_SRC emacs-lisp
(load "/Users/jay/Dropbox/emacs/prelude/personal/new-latex-templates/blue-ruin.el") 
(load "/Users/jay/Dropbox/emacs/prelude/personal/new-latex-templates/blue-ruin_no_cover.el") 
(load "/Users/jay/Dropbox/emacs/prelude/personal/new-latex-templates/jay-latex-yosemite-setup.el") 
(require 'blue-ruin) 
(require 'blue-ruin-no-cover) 
   #+END_SRC


* Backups
Make backups:
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `(("." . "~/.saves")))
(setq
 backup-by-copying t      ; don't clobber symlinks
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t)       ; use versioned backups
#+END_SRC

Make backups of files, even when they're in version control:
#+BEGIN_SRC emacs-lisp
(setq vc-make-backup-files t)
#+END_SRC

* Message mode

** Report problems with the SMTP server

#+BEGIN_SRC emacs-lisp
(setq smtpmail-debug-info t)
#+END_SRC

** Add Cc and Bcc headers to the message buffer

#+BEGIN_SRC emacs-lisp
;; (setq message-default-mail-headers "Cc: \nBcc: \n")
(setq mail-user-agent 'message-user-agent)
(setq auto-mode-alist (cons '("\\.email" . message-mode) auto-mode-alist))
#+END_SRC

** Wrapper for ~message-mail~ that prompts for the 'to' and 'subject' lines

#+BEGIN_SRC emacs-lisp
(defun mail-region (b e to subject)
  "Send the current region in an email"
  (interactive "r\nsRecipient: \nsSubject: ")
  (let ((orig-buffer (current-buffer)))
    (message-mail to subject)
    (message-goto-body)
    (insert (save-excursion (set-buffer orig-buffer)
			    (buffer-substring-no-properties b e)))
    (message-send-and-exit)))
#+END_SRC

** Forgot what this is

#+BEGIN_SRC emacs-lisp
(add-to-list 'completion-styles 'initials t)
#+END_SRC

** orgstruct mode
#+BEGIN_SRC emacs-lisp
;; orgstruct++-mode is enabled in Gnus message buffers to aid in creating structured email messages.
;; (add-hook 'message-mode-hook 'orgstruct-mode 'append)
; (add-hook 'message-mode-hook 'bbdb-define-all-aliases 'append)
(add-hook 'message-mode-hook 'turn-on-flyspell 'append)
#+END_SRC

** Remember recent email addresses

#+BEGIN_SRC emacs-lisp
(setq recent-addresses-file "~/Dropbox/emacs/prelude/recent-addresses")
(add-to-list 'load-path "~/gnulisp/recent-addresses-0.1/")
(require 'recent-addresses)
(recent-addresses-mode 1)
(add-hook 'message-setup-hook 'recent-addresses-add-first-to)

(setq mail-default-directory
   "~/Dropbox/writing/notationaldata/emacs-mail-message-mode-messages")
(setq mail-kill-buffer-on-exit t)
(setq make-backup-files t)
(setq message-draft-headers (quote (From References Date)))
(setq message-kill-buffer-on-exit t)
(setq message-required-headers (quote (From (optional . References))))
(setq message-send-hook (quote (recent-addresses-add-headers)))
(setq message-send-hook (quote (org-mime-htmlize))) ; broke my other functions
#+END_SRC

* Pomodoro

#+BEGIN_SRC emacs-lisp
;; (require 'org-pomodoro)

(defun pomodoro-start ()
  (interactive)
  (play-sound-file "~/sounds/mgm-lion-roar-short.mp3")
  (org-pomodoro)
  )
#+END_SRC

* Reveal in finder

#+BEGIN_SRC emacs-lisp
;; (require 'reveal-in-finder)
#+END_SRC

* ~eshell~

#+BEGIN_SRC emacs-lisp
(setenv "PATH" (shell-command-to-string "source ~/.profile; echo -n $PATH"))
;; (require 'eshell-autojump)
#+END_SRC

* ~ibuffer~

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-b") 'ibuffer)
(autoload 'ibuffer "ibuffer" "List buffers." t)
#+END_SRC

Defines ~ibuffer-do-replace-string~:
#+BEGIN_SRC emacs-lisp
(define-ibuffer-op replace-string (from-str to-str)
  "Perform a `replace-string' in marked buffers."
  (:interactive
   (let* ((from-str (read-from-minibuffer "Replace string: "))
          (to-str (read-from-minibuffer (concat "Replace " from-str
                                                " with: "))))
     (list from-str to-str))
   :opstring "replaced in"
   :complex t
   :modifier-p :maybe)
  (save-window-excursion
    (switch-to-buffer buf)
    (save-excursion
      (goto-char (point-min))
      (let ((case-fold-search ibuffer-case-fold-search))
        (while (search-forward from-str nil t)
          (replace-match to-str nil t))))
    t))
#+END_SRC

* Edit with Emacs

To enable Edit with Emacs in Chrome:
#+BEGIN_SRC emacs-lisp
;; (require 'edit-server)
(edit-server-start)
#+END_SRC

